Tekla Open API Reference for Tekla Structures 2025
GridPlane Constructor (Plane, String)
 Creates a new grid plane instance taking the plane and label as input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridPlane(
	Plane Plane,
	string Label
)
Public Sub New (
	Plane As Plane,
	Label As String
)
Parameters
Plane
Type: Tekla.Structures.Model.Plane
The plane that defines the grid plane.
Label
Type: System.String
The label for the grid plane.
See Also
Reference
GridPlane Class
GridPlane Overload
Tekla.Structures.Model Namespace